//Необходимо создать свой класс представляющий стек, который поддерживает операции добавления, удаления, получения верхнего элемента и получения минимального элемента за константное время.
//Необходимо реализовать класс `MinStack` со следующими методами:
//- `MinStack()` -конструктор класса;
//- `void Push(int val)` -добавляет элемент `val` на вершину стека;
//- `void Pop()` -удаляет элемент, находящийся на вершине стека;
//- `int Top()` -возвращает верхний элемент стека;
//- `int GetMin()` -возвращает минимальный элемент стека.
//Все методы должны работать за O(1) время. 
//Внутренне стэк должен использовать односвязаный список.



namespace Practical_work_2 {
    internal class _2_Task5 {
    }
}
